{
  "add_cross_attention": false,
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "bullying",
    "1": "coercion",
    "2": "grooming",
    "3": "hate",
    "4": "sextortion",
    "5": "sexual",
    "6": "threat",
    "7": "toxicity"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "bullying": 0,
    "coercion": 1,
    "grooming": 2,
    "hate": 3,
    "sextortion": 4,
    "sexual": 5,
    "threat": 6,
    "toxicity": 7
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 130,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "tokenizer_class": "BertweetTokenizer",
  "transformers_version": "5.12.1",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 64001
}
